{"id": "90539393", "title": "Smt. Jayanti Das Baishnab vs The State Of Tripura on 25 February, 2019", "source": "Tripura High Court", "text": ["Page 1 of 4 HIGH COURT OF TRIPURA AGARTALA WP(C) No.444/2018Smt.", "The Director of School Education, Education Department,Government of Tripura, having his office at Shiksha Bhawan,Office Lane, P.O.-Agartala, PS-West Agartala, District-WestTripura.", "---- Respondent(s).", "For the Petitioner(s) : Mr. Somik Deb, Advocate, Mr. Anujit Dey, Advocate, Mr. Koomar Chakraborty, Advocate.", "For Respondent(s) : Mr. Dipankar Sharma, Addl.", "HON'BLE THE CHIEF JUSTICE MR.", "SANJAY KAROL HON'BLE", "MR. JUSTICE S. TALAPATRA Order25/02/2019 The petitioner has prayed for the following reliefs:", "\"(i) Issue Rule, calling upon the respondents and each one of them, to show cause as to why a Writ of Certiorari and/or in the nature thereof, shall not be issued, for directing them, to transmit the records, and for quashing/setting aside the Page 2 of 4impugned Offer of Appointment, insofar as itgrants a fixed monthly pay to the petitioner,thereby negating the benefits of seniority of thepast services, rendered by the petitioner, regularpay scale, pay protection i.e., counting the pastservices for the purpose of fixation of pay, leaveencashment, leave salary, gratuity and all otheradmissible service benefits, including pension, indefiance of the directions, contained in theJudgment & Order dated 07.05.2014, as affirmed,vide the Judgment & Order dated 23.3.2017;", "Page 2 of 4", "(ii) Issue Rule, calling upon the Respondentsand each one of them, to show cause as to why aWrit of mandamus and/or in the nature thereof,shall not be issued, for mandating/directing them,to revoke/rescind the impugned Offer ofAppointment dated 14.03.2018, and thereupon,grant the benefits of seniority of the past services,rendered by the petitioner, regular pay scale, payprotection, i.e., counting the past services for thepurpose of fixation of pay, leave encashment,leave salary, gratuity and all other admissibleservice benefits, including pension, as well as thearrears of salary and allowances, in conformitywith the directions, contained in the Judgment &Order dated 07.05.2014, as affirmed, vide theJudgment & Order dated 23.03.2017;", "(iii) Call for the records, appertaining to thispetition;", "(iv) After hearing the parties, be pleased tomake the Rule absolute in terms of i. & ii.", "(v) Costs of and incidental to this proceeding;", "Page 3 of 4", "(vi) Any other Relief(s) as to this Hon'ble High Court may deem fit and proper.\"", "Learned counsel for the petitioner, on instructions, seekspermission to withdraw the present petition reserving liberty tothe petitioner to place additional materials/representation, if sorequired and desired, in accordance with law.", "Learned counsel for the respondents has no objection to thesame.", "As such, petition stands disposed of having been withdrawnin the following mutually agreed terms:", "(1) Petitioner's representation shall be considered by the appropriate authority and decided expeditiously in accordance with law and positively within a period of three months from today.", "(2) If so required and desired, it shall be open to the writ petitioner(s) to place additional materials in support of earlier representation, if any.", "(3) Additionally, if so desired, petitioner(s) may also request for affording opportunity of hearing.", "(4) The authority shall positively pass the order in the aforesaid terms, by assigning reasons and copy thereof shall also be supplied to the writ petitioner(s).", "(5) Liberty is reserved to the writ petitioner(s) to independently approach the Court for assailing the order, if Page 4 of 4 so required and desired on the same and subsequent cause of action, in accordance with law.", "Page 4 of 4", "(6) All issues are left open.", "(S. TALAPATRA), J (SANJAY KAROL), CJPulak"]}
